{
  "68824527e3566ea5345f9bbd": {
    "video_id": "68824527e3566ea5345f9bbd",
    "video_analysis": "```json\n{\n  \"spec\": \"In statistics, linear regression is a method for modeling the relationship between an output variable and one or more input variables. This method helps in making predictions based on the assumption of a linear relationship between the variables. The goal is to find the best fit line that minimizes the sum of squared errors (SSE) between the data points and the line.\n\n  Build an interactive web app to help learners understand linear regression.\n\n  SPECIFICATIONS:\n\n  1. The app must feature an interactive scatter plot with draggable data points.\n  2. The app must display a best fit line that adjusts in real-time as data points are moved.\n  3. The app must show residuals (vertical lines) between each data point and the best fit line.\n  4. The app must calculate and display the sum of squared errors (SSE) as the data points are adjusted.\n  5. The app must allow users to toggle between viewing the residuals and the SSE.\n  6. The app must include a section to input the coefficients (beta 0 and beta 1) manually and observe the changes in the best fit line.\n  7. The app must provide a visual representation of the training and test data sets, with the ability to split the data into these sets.\n  8. The app must display performance metrics such as R-squared, Standard Error of the Estimate, Prediction Interval, and Statistical Significance for the best fit line.\n  9. The app must include a simple tutorial or guide explaining the concepts of linear regression, residuals, SSE, and performance metrics.\n  10. The app must be designed with a clean, intuitive interface that encourages exploration and learning.\"\n}\n```",
    "html_file_path": "generated_games/video_game_93e17a03e2d49adc_1753367979.html",
    "created_at": "2025-07-24 14:39:39 UTC",
    "cached": true,
    "youtube_url": "https://www.youtube.com/watch?v=3dhcmeOTZ_Q",
    "video_title": "Linear Regression in 3 Minutes",
    "channel_name": "",
    "view_count": "",
    "cached_at": "2025-07-24 14:39:39 UTC"
  }
}