{
  "68824527e3566ea5345f9bbd": {
    "video_id": "68824527e3566ea5345f9bbd",
    "video_analysis": "```json\n{\n  \"spec\": \"In statistics, linear regression is a method for modeling the relationship between an output variable and one or more input variables. This method helps in making predictions based on the assumption of a linear relationship between the variables. The goal is to find the best fit line that minimizes the sum of squared errors (SSE) between the data points and the line.\n\n  Build an interactive web app to help learners understand linear regression.\n\n  SPECIFICATIONS:\n\n  1. The app must feature an interactive scatter plot with draggable data points.\n  2. The app must display a best fit line that adjusts in real-time as data points are moved.\n  3. The app must show residuals (vertical lines) between each data point and the best fit line.\n  4. The app must calculate and display the sum of squared errors (SSE) as the data points are adjusted.\n  5. The app must allow users to toggle between viewing the residuals and the SSE.\n  6. The app must include a section to input the coefficients (beta 0 and beta 1) manually and observe the changes in the best fit line.\n  7. The app must provide a visual representation of the training and test data sets, with the ability to split the data into these sets.\n  8. The app must display performance metrics such as R-squared, Standard Error of the Estimate, Prediction Interval, and Statistical Significance for the best fit line.\n  9. The app must include a simple tutorial or guide explaining the concepts of linear regression, residuals, SSE, and performance metrics.\n  10. The app must be designed with a clean, intuitive interface that encourages exploration and learning.\"\n}\n```",
    "html_file_path": "generated_games/video_game_93e17a03e2d49adc_1753367979.html",
    "created_at": "2025-07-24 14:39:39 UTC",
    "cached": true,
    "youtube_url": "https://www.youtube.com/watch?v=3dhcmeOTZ_Q",
    "video_title": "Linear Regression in 3 Minutes",
    "channel_name": "",
    "view_count": "",
    "cached_at": "2025-07-24 14:39:39 UTC"
  },
  "68825e50ec3c5f25fbc4b329": {
    "video_id": "68825e50ec3c5f25fbc4b329",
    "video_analysis": "```json\n{\n  \"spec\": {\n    \"title\": \"4-7-8 Breathing Technique Interactive App\",\n    \"description\": \"An interactive web app designed to teach and reinforce the 4-7-8 breathing technique, which is known as the relaxing breath. This technique involves inhaling for 4 seconds, holding the breath for 7 seconds, and exhaling for 8 seconds. The app aims to reduce anxiety and stress while also aiding sleep induction.\",\n    \"features\": [\n      {\n        \"name\": \"Breathing Timer\",\n        \"description\": \"An interactive timer that guides users through the 4-7-8 breathing technique.\",\n        \"mechanics\": [\n          \"Display a white circle that counts up from one to four to guide the user's inhalation.\",\n          \"After reaching four, display the text 'Hold your breath' and count up from five to seven.\",\n          \"After reaching seven, display a countdown from eight to zero to guide the user's exhalation.\"\n        ]\n      },\n      {\n        \"name\": \"Progress Tracker\",\n        \"description\": \"A visual progress tracker that shows how many times the user has completed the breathing technique.\",\n        \"mechanics\": [\n          \"Display a counter that increments each time the user completes the technique.\",\n          \"After completing the technique, display the text 'REPEAT AGAIN' to encourage continued practice.\"\n        ]\n      },\n      {\n        \"name\": \"Stress Reduction Tips\",\n        \"description\": \"Provides tips on how the 4-7-8 breathing technique can reduce anxiety and stress.\",\n        \"mechanics\": [\n          \"Display text explaining the benefits of the technique, such as reducing anxiety and stress and aiding sleep induction.\"\n        ]\n      }\n    ],\n    \"design\": {\n      \"colorScheme\": \"Green background with white text and circles.\",\n      \"layout\": \"Centered layout with clear, easy-to-read text and interactive elements.\"\n    }\n  }\n}\n```",
    "html_file_path": "generated_games/video_game_5a3037f577e32d40_1753374420.html",
    "created_at": "2025-07-24 16:27:00 UTC",
    "cached": true,
    "youtube_url": "https://www.youtube.com/watch?v=kpSkoXRrZnE",
    "video_title": "4-7-8 Breathing Technique",
    "channel_name": "",
    "view_count": "",
    "cached_at": "2025-07-24 16:27:00 UTC"
  },
  "68824bc2373253a5d37693e8": {
    "video_id": "68824bc2373253a5d37693e8",
    "video_analysis": "```json\n{\n  \"spec\": \"In statistics, Principal Component Analysis (PCA) is a method to find a linear combination of variables that accounts for as much variability as possible. This helps in simplifying complex data by reducing dimensions while retaining important information.\n\n  Build an interactive web app to help learners understand PCA.\n\n  SPECIFICATIONS:\n\n  1. The app must feature an interactive scatter plot where users can input or drag data points.\n  2. The app must display two principal components (PC1 and PC2) as axes on the scatter plot.\n  3. The app must allow users to combine two variables (e.g., diastolic and systolic blood pressure) into a single variable using a linear combination formula.\n  4. The app must provide sliders to adjust the weights (α1 and α2) of the variables in the linear combination formula.\n  5. The app must show the combined variable's values and the resulting variance on the scatter plot.\n  6. The app must include a constraint that the sum of the squares of the weights equals one (α1^2 + α2^2 = 1).\n  7. The app must allow users to visualize the impact of different weight combinations on the variance of the combined variable.\n  8. The app must provide a brief explanation of why maximizing variance is important when combining variables.\n  9. The app must include examples of how PCA can be used in biology to analyze gene expression data and identify individuals with similar health profiles.\n  10. The app must have a simple, playful design with clear instructions and feedback to promote understanding.\"\n}\n```",
    "html_file_path": "generated_games/video_game_68824bc2373253a5d37693e8_1753376034.html",
    "created_at": "2025-07-24 16:53:54 UTC",
    "cached": true,
    "youtube_url": "",
    "video_title": "TwelveLabs Video 68824bc2373253a5d37693e8",
    "channel_name": "TwelveLabs",
    "view_count": "Generated",
    "cached_at": "2025-07-24 16:53:54 UTC"
  }
}