{
  "686182c2da8b16ab27af8c64": {
    "video_id": "686182c2da8b16ab27af8c64",
    "video_analysis": "```json\n{\n  \"spec\": \"In machine learning, linear regression is a supervised algorithm used to predict continuous numerical data based on labeled datasets. This app aims to help learners understand the concept of linear regression through interactive and engaging design.\\n\\nSPECIFICATIONS:\\n\\n1. The app must feature an interactive graph with a horizontal axis labeled 'Height in Inches' and a vertical axis labeled 'Shoe Size [US]'.\\n2. The app must allow users to input data points representing different heights and corresponding shoe sizes.\\n3. The app must automatically plot these data points on the graph.\\n4. The app must provide a feature to draw a best fit line through the plotted data points, indicating the positive correlation between height and shoe size.\\n5. The app must allow users to identify outliers by highlighting specific data points.\\n6. The app must include a section to explain the concept of labeled datasets and the difference between continuous and categorical data.\\n7. The app must provide examples of continuous data (height, age, foot size) and categorical data (color, gender).\\n8. The app must allow users to toggle between different types of data to see how they affect the best fit line.\\n9. The app must include a section to explain the importance of linear regression in machine learning and how it can be used to make predictions.\\n10. The app must have a playful design with clear instructions and feedback to enhance user engagement and understanding.\"\n}\n```",
    "html_file_path": "generated_games/video_game_686182c2da8b16ab27af8c64_1751321613.html",
    "created_at": "2025-06-30 22:13:33 UTC",
    "cached": true,
    "youtube_url": "https://www.youtube.com/watch?v=qxo8p8PtFeA",
    "video_title": "Why Linear regression for Machine Learning?",
    "twelvelabs_video_ids": [
      "686182c2da8b16ab27af8c64"
    ],
    "primary_video_id": "686182c2da8b16ab27af8c64",
    "total_chunks": null,
    "cache_key": "ed463b330e0c117d",
    "cached_at": "2025-06-30 22:13:33 UTC"
  },
  "686153da21f0ea193ed033fa": {
    "video_id": "686153da21f0ea193ed033fa",
    "video_analysis": "```json\n{\n  \"spec\": \"In the video, Michelle leads a 3-minute stretching routine that includes breathing exercises, arm stretches, elbow rotations, and torso twists. The routine is designed to be a quick and effective way to start the day with a bit of exercise and mindfulness.\\n\\nBuild an interactive web app to help learners understand and practice the stretching routine.\\n\\nSPECIFICATIONS:\\n\\n1. The app must feature a simple, user-friendly interface with clear instructions and visual cues.\\n2. The app must include an animated avatar that demonstrates each stretch in the routine.\\n3. The app must provide audio cues for breathing exercises, guiding users to inhale and exhale at the appropriate times.\\n4. The app must allow users to select and practice individual stretches or the entire routine.\\n5. The app must include a timer that counts down the duration of each stretch and the entire routine.\\n6. The app must offer a brief explanation of the benefits of each stretch, such as improved flexibility and reduced stress.\\n7. The app must include a feature to track the user's progress and encourage regular practice.\\n8. The app must allow users to customize the routine by adjusting the duration of each stretch or adding/removing stretches.\\n9. The app must provide a 'rewatch' button that allows users to revisit the routine at any time.\\n10. The app must include a section for additional resources, such as tips for maintaining a regular stretching routine and links to other related videos or articles.\"\n}\n```",
    "html_file_path": "generated_games/video_game_686153da21f0ea193ed033fa_1751542052.html",
    "created_at": "2025-07-03 11:27:32 UTC",
    "cached": true,
    "youtube_url": "https://www.youtube.com/watch?v=_2v6Mbx5v1w",
    "video_title": "3-min Stretch | Great in the morning or between work! | Beginners | Apartment Friendly",
    "channel_name": "",
    "view_count": "",
    "cache_key": "0cd6e502bd723141",
    "cached_at": "2025-07-03 11:27:32 UTC"
  },
  "dd2f49f007938719": {
    "video_id": "dd2f49f007938719",
    "video_analysis": "```json\n{\n  \"spec\": \"In neural networks, data flows through interconnected layers of nodes, each of which can be thought of as a linear regression model. The network learns and improves its accuracy over time through training data and backpropagation. Different types of neural networks, such as CNNs and RNNs, are suited for various tasks like image recognition and time series prediction.\n\n  Build an interactive web app to help learners understand the basics of neural networks.\n\n  SPECIFICATIONS:\n\n  1. The app must feature a visual representation of a neural network with input, hidden, and output layers.\n  2. The app must allow users to input data into the input layer and see how it flows through the network to the output layer.\n  3. The app must showcase the concept of linear regression models within each node, showing how inputs are multiplied by weights and added to a bias term.\n  4. The app must include a section where users can adjust the weights and biases of the nodes and observe how these changes affect the output.\n  5. The app must explain the concept of backpropagation and allow users to simulate the process of adjusting weights and biases based on training data.\n  6. The app must include examples of different types of neural networks, such as CNNs and RNNs, and explain their unique architectures and applications.\n  7. The app must provide a simple, playful interface with clear instructions and feedback to promote understanding and engagement.\n  8. The app must allow users to experiment with different scenarios and observe the outcomes, reinforcing the concepts of data flow, linear regression, and backpropagation.\"\n}\n```",
    "html_file_path": "generated_games/video_game_dd2f49f007938719_1751215276.html",
    "created_at": "2025-06-29 16:41:16 UTC",
    "cached": true,
    "youtube_url": "https://www.youtube.com/watch?v=jmmW0F0biz0",
    "video_title": "Neural Networks Explained in 5 minutes",
    "twelvelabs_video_ids": [
      "68616c3a042f13dfd543c91f"
    ],
    "primary_video_id": "68616c3a042f13dfd543c91f",
    "total_chunks": null,
    "cache_key": "dd2f49f007938719",
    "cached_at": "2025-06-29 16:41:16 UTC"
  },
  "e0f30888d8ae998d": {
    "video_id": "e0f30888d8ae998d",
    "video_analysis": "```json\n{\n  \"spec\": \"Build an interactive web app to help learners understand SHAP values and their application in machine learning models.\\n\\nSPECIFICATIONS:\\n\\n1. The app must feature a simple, user-friendly interface with clear navigation.\\n2. The app must include an interactive section where users can input different feature values for a hypothetical employee, such as years of experience, degree status, sales performance, and days late.\\n3. The app must display a bar chart that shows the SHAP values for each input feature, illustrating how each feature contributes to the predicted bonus.\\n4. The app must provide a visual explanation of SHAP values, including how they increase or decrease the prediction compared to the average prediction across all employees.\\n5. The app must include a section that explains the concept of SHAP values in the context of classification problems, using an example of predicting whether a mushroom is poisonous or edible.\\n6. The app must allow users to explore different scenarios by changing feature values and observing the impact on the predicted outcome and SHAP values.\\n7. The app must include a debugging section where users can input incorrect predictions and understand which features have caused the error.\\n8. The app must provide human-friendly explanations for predictions, highlighting the key features that influenced the outcome.\\n9. The app must include a data exploration section where users can learn about hidden patterns and interactions within the data set.\\n10. The app must offer a brief introduction to the theory behind SHAP and a guide to using the Python SHAP package, with links to further resources for learning.\"\n}\n```",
    "html_file_path": "generated_games/video_game_e0f30888d8ae998d_1751321944.html",
    "created_at": "2025-06-30 22:19:04 UTC",
    "cached": true,
    "youtube_url": "https://www.youtube.com/watch?v=MQ6fFDwjuco",
    "video_title": "SHAP values for beginners | What they mean and their applications",
    "twelvelabs_video_ids": [
      "68630ce0913f41f63f5d2380"
    ],
    "primary_video_id": "68630ce0913f41f63f5d2380",
    "total_chunks": null,
    "cache_key": "e0f30888d8ae998d",
    "cached_at": "2025-06-30 22:19:04 UTC"
  },
  "68631901913f41f63f5d251b": {
    "video_id": "68631901913f41f63f5d251b",
    "video_analysis": "I regret to inform you that the question you've asked is of such complexity that a definitive answer eludes our current knowledge and understanding.",
    "html_file_path": "generated_games/video_game_68631901913f41f63f5d251b_1751325086.html",
    "created_at": "2025-06-30 23:11:26 UTC",
    "cached": true,
    "youtube_url": "https://www.youtube.com/watch?v=T-D1OfcDW1M",
    "video_title": "What is Retrieval-Augmented Generation (RAG)?",
    "channel_name": "",
    "view_count": "",
    "cache_key": "e30b1a0332f1f9ac",
    "cached_at": "2025-06-30 23:11:26 UTC"
  },
  "c88ef2d11a87a57d": {
    "video_id": "c88ef2d11a87a57d",
    "video_analysis": "```json\n{\n  \"spec\": \"In the realm of data storage and retrieval, vector databases offer a powerful way to store and query unstructured data, such as images, text, and audio, by capturing their semantic essence through vector embeddings. This approach bridges the semantic gap between how humans understand data and how computers store it, enabling nuanced similarity searches.\\n\\nBuild an interactive web app to help learners understand vector databases and their applications.\\n\\nSPECIFICATIONS:\\n\\n1. The app must feature an interactive canvas where users can draw simple images or upload images.\\n2. The app must display a relational database model and a vector database model side by side for comparison.\\n3. The app must explain the concept of the semantic gap and how vector databases address it.\\n4. The app must allow users to convert their drawn or uploaded images into vector embeddings and display the numerical values of these embeddings.\\n5. The app must provide a feature to compare the vector embeddings of two different images and highlight the similarities and differences.\\n6. The app must showcase examples of embedding models (Clip for images, GloVe for text, and Wav2Vec for audio) and explain how they create vector embeddings.\\n7. The app must demonstrate the process of vector indexing using approximate nearest neighbor algorithms and show how it enables efficient similarity search.\\n8. The app must include a section on RAG (Retrieval Augmented Generation) and explain how vector databases are used in this context.\\n9. The app must provide a simple, playful interface with clear instructions and feedback to enhance user engagement and understanding.\"\n}\n```",
    "html_file_path": "generated_games/video_game_c88ef2d11a87a57d_1751362880.html",
    "created_at": "2025-07-01 09:41:20 UTC",
    "cached": true,
    "youtube_url": "https://www.youtube.com/watch?v=gl1r1XV0SLw",
    "video_title": "What is a Vector Database? Powering Semantic Search & AI Applications",
    "twelvelabs_video_ids": [
      "6863aca366e177b742cc6724"
    ],
    "primary_video_id": "6863aca366e177b742cc6724",
    "total_chunks": null,
    "cache_key": "c88ef2d11a87a57d",
    "cached_at": "2025-07-01 09:41:20 UTC"
  },
  "6863ae6866e177b742cc676e": {
    "video_id": "6863ae6866e177b742cc676e",
    "video_analysis": "```json\n{\n  \"spec\": {\n    \"title\": \"Interactive Dance Studio\",\n    \"description\": \"An engaging web app that helps users learn and practice dance moves inspired by a dynamic dance performance.\",\n    \"features\": [\n      {\n        \"name\": \"Dance Move Library\",\n        \"description\": \"A collection of dance moves demonstrated in the performance, categorized by complexity and style.\",\n        \"mechanics\": [\n          \"Users can browse and select dance moves from the library.\",\n          \"Each move includes a step-by-step guide with visual aids.\"\n        ]\n      },\n      {\n        \"name\": \"Practice Mode\",\n        \"description\": \"Allows users to practice selected dance moves in a virtual studio environment.\",\n        \"mechanics\": [\n          \"Users can set the tempo and difficulty level.\",\n          \"The app provides real-time feedback on form and timing.\"\n        ]\n      },\n      {\n        \"name\": \"Choreography Builder\",\n        \"description\": \"Enables users to create their own dance routines using the library of moves.\",\n        \"mechanics\": [\n          \"Users can drag and drop moves into a timeline.\",\n          \"The app generates a video preview of the routine.\"\n        ]\n      }\n    ],\n    \"design\": {\n      \"colorScheme\": [\"#FFC107\", \"#28A745\", \"#17A2B8\"],\n      \"fontFamily\": \"Roboto\",\n      \"layout\": \"Responsive layout optimized for mobile and desktop.\"\n    },\n    \"development\": {\n      \"technologyStack\": [\"HTML\", \"CSS\", \"JavaScript\"],\n      \"libraries\": [\"jQuery\", \"Bootstrap\"],\n      \"testing\": \"Unit tests and integration tests using Jest and Cypress.\"\n    }\n  }\n}\n```",
    "html_file_path": "generated_games/video_game_6863ae6866e177b742cc676e_1751541364.html",
    "created_at": "2025-07-03 11:16:04 UTC",
    "cached": true,
    "youtube_url": "https://www.youtube.com/watch?v=w5cZM23PG-k",
    "video_title": "On The Floor - Jenefer Lopes (Dance Cover) | Orangie Choreography",
    "channel_name": "",
    "view_count": "",
    "cache_key": "5c35c36dfe1615b8",
    "cached_at": "2025-07-03 11:16:04 UTC"
  },
  "6863b03266e177b742cc67c6": {
    "video_id": "6863b03266e177b742cc67c6",
    "video_analysis": "```json\n{\n  \"spec\": {\n    \"title\": \"Dance Studio Rhythm and Flow\",\n    \"description\": \"An interactive web app designed to help learners understand rhythm and flow in dance.\",\n    \"features\": [\n      {\n        \"name\": \"Interactive Dance Floor\",\n        \"description\": \"A virtual dance floor where users can perform dance moves and see their effects in real-time.\",\n        \"mechanics\": [\n          \"Users can select different dance styles and levels of difficulty.\",\n          \"The app provides visual feedback on timing and synchronization.\",\n          \"Users can record and share their performances.\"\n        ]\n      },\n      {\n        \"name\": \"Rhythm Generator\",\n        \"description\": \"A tool that generates rhythmic patterns for users to practice and improve their timing.\",\n        \"mechanics\": [\n          \"Users can choose from various rhythmic patterns and tempos.\",\n          \"The app provides visual cues to help users follow the rhythm.\",\n          \"Users can adjust the complexity of the patterns as they progress.\"\n        ]\n      },\n      {\n        \"name\": \"Flow Visualization\",\n        \"description\": \"A feature that illustrates the flow of movement in dance, helping users understand how to transition smoothly between moves.\",\n        \"mechanics\": [\n          \"The app uses animations and diagrams to show the flow of movement.\",\n          \"Users can explore different flow patterns and see how they affect the overall performance.\",\n          \"The app provides tips and exercises to improve flow and fluidity.\"\n        ]\n      }\n    ],\n    \"design\": {\n      \"colorScheme\": [\"#FFC107\", \"#28A745\", \"#17A2B8\"],\n      \"fontFamily\": \"Roboto\",\n      \"layout\": \"Responsive layout with a clean and modern design.\"\n    },\n    \"development\": {\n      \"technologyStack\": [\"HTML\", \"CSS\", \"JavaScript\"],\n      \"libraries\": [\"jQuery\", \"Bootstrap\"],\n      \"testing\": \"Unit tests and integration tests using Jest and Cypress.\"\n    }\n  }\n}\n```",
    "html_file_path": "generated_games/video_game_6863b03266e177b742cc67c6_1751577410.html",
    "created_at": "2025-07-03 21:16:50 UTC",
    "cached": true,
    "youtube_url": "https://www.youtube.com/watch?v=wjzMS8FBXSk",
    "video_title": "Espresso - Sabrina Carpenter | HEXXY Choreography",
    "channel_name": "",
    "view_count": "",
    "cached_at": "2025-07-03 21:16:50 UTC"
  },
  "6863b1fc6b30ee3bee7381a2": {
    "video_id": "6863b1fc6b30ee3bee7381a2",
    "video_analysis": "```json\n{\n  \"spec\": \"Build an interactive web app to help learners understand the historical context and development of the seven islands of Mumbai.\\n\\nSPECIFICATIONS:\\n\\n1. The app must feature an interactive map of the seven islands of Mumbai, allowing users to zoom in and out and click on each island to see detailed information.\\n2. The app must include a timeline feature that allows users to explore the historical periods during which different rulers and empires controlled the islands, from the 2nd century BC to the 9th century CE.\\n3. The app must provide a section on land reclamation, where users can interactively see how the islands were joined together by the British East India Company through various civil engineering projects.\\n4. The app must include a quiz section where users can test their knowledge about the historical rulers, empires, and the process of land reclamation.\\n5. The app must have a feature that allows users to view historical photos and illustrations of the construction sites and the development of the islands.\\n6. The app must include a section on the demographic changes in the region due to immigration, with interactive charts showing the population increase from 10,000 to 60,000 during the period 1661-1675 AD.\\n7. The app must have a section on the economic impact of the land reclamation, showing how the islands became a significant trading center and harbor for the British.\\n8. The app must allow users to play a mini-game where they can virtually construct the causeways and embankments that unified the islands, reinforcing the concept of land reclamation.\\n9. The app must include a glossary of terms related to the historical context and development of the islands, such as 'civil engineering projects', 'land reclamation', and 'causeways'.\\n10. The app must have a feature that allows users to explore the current city layout and compare it with the historical maps, highlighting the areas that were once separate islands.\"\n}\n```",
    "html_file_path": "generated_games/video_game_6863b1fc6b30ee3bee7381a2_1751578082.html",
    "created_at": "2025-07-03 21:28:02 UTC",
    "cached": true,
    "youtube_url": "https://www.youtube.com/watch?v=rpMeNGfdVqk",
    "video_title": "History of Mumbai: A city of Seven Islands | General Geography | Land Reclamation | UPSC CSE",
    "channel_name": "",
    "view_count": "",
    "cached_at": "2025-07-03 21:28:02 UTC"
  },
  "6863b381487d08d06eebb96f": {
    "video_id": "6863b381487d08d06eebb96f",
    "video_analysis": "```json\n{\n  \"spec\": \"In data science, Principal Component Analysis (PCA) is a technique used to reduce the number of dimensions in large datasets while retaining most of the original information. This is particularly useful for data visualization and machine learning applications.\\n\\nBuild an interactive web app to help learners understand PCA and its applications.\\n\\nSPECIFICATIONS:\\n\\n1. The app must feature an interactive table where users can input or modify data for multiple loans, including dimensions such as loan amount, credit score, annual income, and years in job.\\n2. The app must display a scatter plot that visualizes the data points based on the first two principal components (PC1 and PC2) derived from the input data.\\n3. The app must allow users to toggle the visibility of different dimensions in the scatter plot to observe how PCA reduces dimensionality and retains essential information.\\n4. The app must include a section that explains the concept of principal components, highlighting how they are linear combinations of the original variables that capture the maximum variance.\\n5. The app must provide examples of PCA use cases, such as image compression, data visualization, noise filtration, and healthcare applications, with interactive elements to demonstrate each use case.\\n6. The app must include a brief history section that mentions PCA's development in 1901 and its relevance in modern machine learning applications.\\n7. The app must have a simple, playful design with clear instructions and feedback to guide users through the interactive elements.\\n8. The app must be responsive and accessible, ensuring a smooth user experience across different devices and screen sizes.\"\n}\n```",
    "html_file_path": "generated_games/video_game_6863b381487d08d06eebb96f_1751364736.html",
    "created_at": "2025-07-01 10:12:16 UTC",
    "cached": true,
    "youtube_url": "https://www.youtube.com/watch?v=ZgyY3JuGQY8&t=3s",
    "video_title": "Principal Component Analysis (PCA) Explained: Simplify Complex Data for Machine Learning",
    "channel_name": "",
    "view_count": "",
    "cache_key": "66d1ef4bb14d0638",
    "cached_at": "2025-07-01 10:12:16 UTC"
  },
  "6863b8d56b30ee3bee7383ef": {
    "video_id": "6863b8d56b30ee3bee7383ef",
    "video_analysis": "```json\n{\n  \"spec\": \"In Principal Component Analysis (PCA), the goal is to reduce the dimensionality of data while preserving as much variance as possible. This is achieved by scaling and centering the data, and then identifying the principal components that capture the most variance.\\n\\nBuild an interactive web app to help learners understand PCA.\\n\\nSPECIFICATIONS:\\n\\n1. The app must feature an interactive scatter plot where users can input or drag data points.\\n2. The app must allow users to scale the data by adjusting the range of values for each variable. This can be done through sliders or input fields.\\n3. The app must center the data by shifting the origin to the mean of the data points. This should be a toggleable feature.\\n4. The app must display the principal components (PC1 and PC2) as lines on the scatter plot. Users should be able to see how these lines change as they scale and center the data.\\n5. The app must explain the concept of scaling and centering, and how these processes affect the PCA results. This can be done through tooltips or a help section.\\n6. The app must allow users to add or remove data points to observe how the number of samples affects the number of principal components. This should be clearly indicated on the scatter plot.\\n7. The app must display the eigenvalues for each principal component, showing the amount of variance captured by each component.\\n8. The app must include a simple example dataset to demonstrate the concepts, such as student scores in Math and Reading.\\n9. The app must have a clear and simple interface with minimal distractions to focus on the core mechanics of PCA.\\n10. The app must be responsive and work well on both desktop and mobile devices.\"\n}\n```",
    "html_file_path": "generated_games/video_game_6863b8d56b30ee3bee7383ef_1751577038.html",
    "created_at": "2025-07-03 21:10:38 UTC",
    "cached": true,
    "youtube_url": "https://www.youtube.com/watch?v=oRvgq966yZg",
    "video_title": "StatQuest: PCA - Practical Tips",
    "channel_name": "",
    "view_count": "",
    "cached_at": "2025-07-03 21:10:38 UTC"
  },
  "1b590d8d297bca42": {
    "video_id": "1b590d8d297bca42",
    "video_analysis": "```json\n{\n  \"spec\": {\n    \"title\": \"Grok-3 Interactive Web App\",\n    \"description\": \"An interactive web app designed to complement and reinforce the key ideas presented about Grok-3, an advanced artificial intelligence model with enhanced reasoning and computational capabilities.\",\n    \"features\": [\n      {\n        \"name\": \"Interactive Chat Interface\",\n        \"description\": \"Users can engage in a simulated conversation with Grok-3, asking questions and receiving detailed explanations.\",\n        \"mechanics\": [\n          \"Users type questions into a text box.\",\n          \"Grok-3 responds with detailed answers, explaining the reasoning behind them.\"\n        ]\n      },\n      {\n        \"name\": \"Think Mode Simulation\",\n        \"description\": \"A visual representation of Grok-3's Think Mode, illustrating step-by-step problem-solving.\",\n        \"mechanics\": [\n          \"Users select a problem from a list.\",\n          \"Grok-3 breaks down the problem into smaller steps, showing each step visually.\"\n        ]\n      },\n      {\n        \"name\": \"Big Brain Mode Challenge\",\n        \"description\": \"A series of complex problems that require Grok-3's advanced computational power.\",\n        \"mechanics\": [\n          \"Users choose a challenge from a list.\",\n          \"Grok-3 solves the problem, demonstrating its ability to handle complex tasks.\"\n        ]\n      }\n    ],\n    \"design\": {\n      \"colorScheme\": [\"#007BFF\", \"#FFC107\", \"#28A745\"],\n      \"fontFamily\": \"Arial, sans-serif\",\n      \"layout\": \"Responsive layout with a clean and modern design.\"\n    },\n    \"development\": {\n      \"technologyStack\": [\"HTML\", \"CSS\", \"JavaScript\"],\n      \"libraries\": [],\n      \"dependencies\": []\n    }\n  }\n}\n```",
    "html_file_path": "generated_games/video_game_1b590d8d297bca42_1751544983.html",
    "created_at": "2025-07-03 12:16:23 UTC",
    "cached": true,
    "youtube_url": "https://www.youtube.com/watch?v=lYuXx4TGUk4",
    "video_title": "Elon Musk's Grok-3 AI Model in 2 Minutes",
    "channel_name": "",
    "view_count": "",
    "cached_at": "2025-07-03 12:16:23 UTC"
  },
  "68667949a98231bea6b2a1be": {
    "video_id": "68667949a98231bea6b2a1be",
    "video_analysis": "I regret to inform you that the question you've asked is of such complexity that a definitive answer eludes our current knowledge and understanding.",
    "html_file_path": "generated_games/video_game_68667949a98231bea6b2a1be_1751576568.html",
    "created_at": "2025-07-03 21:02:48 UTC",
    "cached": true,
    "youtube_url": "https://www.youtube.com/watch?v=b0XI-cbel1U",
    "video_title": "Is Elon’s Grok 3 the new AI king?",
    "channel_name": "",
    "view_count": "",
    "cached_at": "2025-07-03 21:02:48 UTC"
  },
  "68667a42a98231bea6b2a1f7": {
    "video_id": "68667a42a98231bea6b2a1f7",
    "video_analysis": "",
    "html_file_path": "generated_games/video_game_68667a42a98231bea6b2a1f7_1751576122.html",
    "created_at": "2025-07-03 20:55:22 UTC",
    "cached": true,
    "youtube_url": "",
    "video_title": "Test Video",
    "channel_name": "",
    "view_count": "",
    "cached_at": "2025-07-03 20:55:22 UTC"
  },
  "6866f392a98231bea6b2c3fd": {
    "video_id": "6866f392a98231bea6b2c3fd",
    "video_analysis": "```json\n{\n  \"spec\": \"In machine learning, a Support Vector Machine (SVM) is a powerful algorithm used for classification tasks. It aims to find the hyperplane that maximizes the margin between different classes of data points. This hyperplane is defined by support vectors, which are the data points closest to the decision boundary.\n\n  Build an interactive web app to help learners understand the core concepts of SVMs.\n\n  SPECIFICATIONS:\n\n  1. The app must feature an interactive scatter plot where users can manually add data points with labels (+1 or -1).\n  2. The app must allow users to adjust the position of a hyperplane using a slider or direct manipulation.\n  3. The app must visually highlight the margin around the hyperplane and indicate which data points are support vectors.\n  4. The app must display the equations of the hyperplane and the margin boundaries (w^T x + b = 1 and w^T x + b = -1).\n  5. The app must include a button to automatically calculate and display the optimal hyperplane that maximizes the margin.\n  6. The app must provide a visual explanation of the constraints (y_i(w^T x_i + b) >= 1) and how they relate to the support vectors.\n  7. The app must allow users to experiment with different data distributions and observe the impact on the hyperplane and margin.\n  8. The app must include a section that explains the dual form of the SVM optimization problem and how it relates to the support vectors.\n  9. The app must provide a simple way to understand the calculation of the bias term (b) using the support vectors.\n  10. The app must include a classifier that predicts the label of a new data point based on the current hyperplane and margin.\n  11. The app must have a clear and concise tutorial section that explains the key concepts and mechanics of SVMs.\n  12. The app must be designed with a simple, playful interface to engage users and promote understanding.\n  \"\n}\n```",
    "html_file_path": "generated_games/video_game_6866f392a98231bea6b2c3fd_1751578171.html",
    "created_at": "2025-07-03 21:29:31 UTC",
    "cached": true,
    "youtube_url": "https://www.youtube.com/watch?v=vIdaGA8Mn-M",
    "video_title": "1.  HARD MARGIN SVM",
    "channel_name": "",
    "view_count": "",
    "cached_at": "2025-07-03 21:29:31 UTC"
  },
  "6866f6b0a98231bea6b2c500": {
    "video_id": "6866f6b0a98231bea6b2c500",
    "video_analysis": "```json\n{\n  \"spec\": {\n    \"title\": \"Parisian Landmarks Interactive App\",\n    \"description\": \"An interactive web app designed to help learners explore and understand the iconic landmarks of Paris.\",\n    \"features\": [\n      {\n        \"name\": \"Interactive Map\",\n        \"description\": \"A map of Paris highlighting key landmarks such as the Eiffel Tower, Louvre Museum, Notre-Dame Cathedral, and Arc de Triomphe. Users can click on each landmark to learn more about its history and significance.\",\n        \"mechanics\": [\n          \"Display a map of Paris with markers for each landmark.\",\n          \"When a user clicks on a marker, show a pop-up window with information about the landmark.\",\n          \"Include images and videos related to each landmark.\"\n        ]\n      },\n      {\n        \"name\": \"Historical Timeline\",\n        \"description\": \"A timeline showcasing the historical context of Parisian landmarks. Users can navigate through different eras to see how the city has evolved over time.\",\n        \"mechanics\": [\n          \"Create a horizontal timeline with markers for different historical periods.\",\n          \"Allow users to drag the timeline to view different eras.\",\n          \"Display relevant images, videos, and text for each period.\"\n        ]\n      },\n      {\n        \"name\": \"Cultural Quiz\",\n        \"description\": \"A quiz to test users' knowledge of Parisian culture and landmarks. Questions cover topics such as art, architecture, and history.\",\n        \"mechanics\": [\n          \"Generate random questions from a predefined list.\",\n          \"Provide multiple-choice answers for each question.\",\n          \"Track the user's score and display it at the end of the quiz.\"\n        ]\n      }\n    ],\n    \"design\": {\n      \"colorScheme\": [\"#FFD700\", \"#008000\", \"#FF69B4\"],\n      \"fontFamily\": \"Arial, sans-serif\",\n      \"layout\": \"Responsive layout that adapts to different screen sizes.\"\n    },\n    \"development\": {\n      \"technology\": \"HTML, CSS, JavaScript\",\n      \"libraries\": [],\n      \"dependencies\": []\n    }\n  }\n}\n```",
    "html_file_path": "generated_games/video_game_6866f6b0a98231bea6b2c500_1751621582.html",
    "created_at": "2025-07-04 09:33:02 UTC",
    "cached": true,
    "youtube_url": "https://www.youtube.com/watch?v=HYbAVU-pI08",
    "video_title": "The City of Paris in less than 2 min",
    "channel_name": "",
    "view_count": "",
    "cached_at": "2025-07-04 09:33:02 UTC"
  }
}